# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
import math

n = int(input('Введите трехзначное число: '))

print(f'Сумма цифр: {abs(n) // 100} + {(abs(n) // 10) % 10} + {abs(n) % 10} = {abs(n) // 100 + ((abs(n) // 10) % 10) + abs(n) % 10}')